package com.metanit;
import java.util.ArrayList;
import java.util.Arrays;
import java.util.Collections;
import java.util.Comparator;
import java.util.List;


public class Main {

    public static void main(String[] args) {

                String verse1 =
                        "Мы, беларусы – мірныя людзі,\n" +
                        "Сэрцам адданыя роднай зямлі,\n" +
                        "Шчыра сябруем, сілы гартуем\n" +
                        "Мы ў працавітай, вольнай сям’і.\n" +
                        "Слаўся, зямлі нашай светлае імя,\n" +
                        "Слаўся, народаў братэрскі саюз!\n" +
                        "Наша любімая маці-Радзіма,\n" +
                        "Вечна жыві і квітней, Беларусь!\n" +
                        "Разам з братамі мужна вякамі\n" +
                        "Мы баранілі родны парог,\n" +
                        "У бітвах за волю, бітвах за долю\n" +
                        "Свой здабывалі сцяг перамог!\n" +
                        "Слаўся, зямлі нашай светлае імя,\n" +
                        "Слаўся, народаў братэрскі саюз!\n" +
                        "Наша любімая маці-Радзіма,\n" +
                        "Вечна жыві і квітней, Беларусь!\n" +
                        "Дружба народаў – сіла народаў –\n" +
                        "Наш запаветны, сонечны шлях.\n" +
                        "Горда ж узвіся ў ясныя высі,\n" +
                        "Сцяг пераможны – радасці сцяг!\n" +
                        "Слаўся, зямлі нашай светлае імя,\n" +
                        "Слаўся, народаў братэрскі саюз!\n" +
                        "Наша любімая маці-Радзіма,\n" +
                        "Вечна жыві і квітней, Беларусь!";

                String verse2 =
                        "Толькі ў сэрцы трывожным пачую\n" +
                        "За краіну радзімую жах, —\n" +
                        "Ўспомню Вострую Браму сьвятую\n" +
                        "I ваякаў па грозных канях.\n" +
                        "Ў белай пене праносяцца коні, —\n" +
                        "Рвуцца, мкнуцца і цяжка хрыпяць...\n" +
                        "Старадаўняй Літоўскай Пагоні\n" +
                        "Не разьбіць, не спыніць, не стрымаць.\n" +
                        "У бязьмерную даль вы ляціце,\n" +
                        "А за вамі, прад вамі — гады.\n" +
                        "Вы за кім у пагоню сьпяшыце?\n" +
                        "Дзе шляхі вашы йдуць і куды?\n" +
                        "Мо яны, Беларусь, панясьліся\n" +
                        "За тваімі дзяцьмі уздагон,\n" +
                        "Што забылі цябе, адракліся,\n" +
                        "Прадалі і аддалі ў палон?\n" +
                        "Бійце ў сэрцы іх — бійце мячамі,\n" +
                        "Не давайце чужынцамі быць!\n" +
                        "Хай пачуюць, як сэрца начамі\n" +
                        "Аб радзімай старонцы баліць...\n" +
                        "Маці родная, Маці-Краіна!\n" +
                        "Не усьцішыцца гэтакі боль...\n" +
                        "Ты прабач, Ты прымі свайго сына,\n" +
                        "За Цябе яму ўмерці дазволь!..\n" +
                        "Ўсё лятуць і лятуць тыя коні,\n" +
                        "Срэбнай збруяй далёка грымяць...\n" +
                        "Старадаўняй Літоўскай Пагоні\n" +
                        "Не разьбіць, не спыніць, не стрымаць.\n";

        System.out.println("\n" + "Неотсортированный массив: ");

        List<String> listArray = new ArrayList<String>(Arrays.asList(verse1.split("\n")));
        listArray.addAll(Arrays.asList(verse2.split("\n")));
        System.out.println(listArray + "\n");

        for(String text:listArray) {
            System.out.println(text);
        }

        System.out.println("\n" + "Отсортированный массив: ");

        Comparator<String> lineLengthComparator = new Comparator<String>() {
            @Override
            public int compare(String o1, String o2) {
                return o1.length() - o2.length();
            }
        };

        Collections.sort(listArray, lineLengthComparator);
        System.out.println(listArray + "\n");

        for(String text:listArray) {
            System.out.println(text);
        }
    }
}

